app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Lol"], ["content", "Lol"], ["user_id", 3], ["created_at", "2020-08-04 17:02:06.993021"], ["updated_at", "2020-08-04 17:02:06.993021"]]
INSERT INTO "users" ("city_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["city_id", 3], ["created_at", "2020-08-04 17:02:06.991251"], ["updated_at", "2020-08-04 17:02:06.991251"]]
---
  def create
    @gossip = Gossip.new(title: params["gossip_title"], content: params["gossip_content"])
    city = City.new
    user = User.new
    user.city = city
    @gossip.user = user
    if @gossip.save