app/views/accueil/home.html.erb

    <h5 class="card-title"> <%= gossip.title %> </h5>
    <h6 class="card-subtitle mb-2 text-muted">créer par : <a href="<%= user_path(gossip.user.id) %>" > <%= gossip.user.first_name %> </a></h6>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]